[
{"course link": "https://talentedge.com/golden-gate-university/doctor-of-business-administration", "title": "Doctor Of Business Administration", "description": "Go beyond the boundaries of your job, without quitting it. Be a sought after specialist with the same doctorate degree awarded on campus. Earn the ‘Dr’ title after successfully completing the program. The Doctor of Business Administration (DBA) program is designed for professionals who want to further their career with the most advanced business degree program GGU offers. The DBA program addresses the learning needs and objectives of senior business managers, consultants and university professors. Its primary objective is to produce graduates who can contribute to the advancement of their professions and to the expansion of knowledge and awareness of contemporary strategic issues and practices.", "duration": "Duration: 36 Months", "Timing": "12-15 hours/week", "start_date": "15 Feb, 2024", "What you will learn": ["Recognizing and solving the business problem", "Research based problem resolution", "Disruptive Innovation Strategy", "Data collection techniques", "Organizational Agility and Winning Execution"], "skills": ["Applied Research", "Concept Selection", "Management Issues Redressal", "Critical Decision-Making", "Critical Thinking"], "target students": "Working professionals who are looking for a transition into the C-suite or Senior Management professionals looking to become experts in their domain of choice.", "Prerequisites / Eligibility criteria": "Master's Degree (or equivalent) or Bachelors Degree with 5+ years of work experience.", "Content": ["Foundation (12 Credits)", "Concentration (12 Credits)", "Final dissertation (32 Credits)"], "university": " Golden Gate University ", "Faculty 1 Name": "Dr. Mick Mcgee", "Faculty 1 Designation": "Director, DBA Program", "Faculty 1 Description": "<p>Director, DBA. Served as a Military Officer for 24 years and has been in the teaching industry with GGU for 22 years now.</p>", "Faculty 2 Name": "Dr. Judith Lee", "Faculty 2 Designation": "Professor & Director, Academic Innovation", "Faculty 2 Description": "<p>Dr. Judith Lee is a Tenured Professor in the Ageno School of Business and Program Director for the MSBA.</p>", "Faculty 3 Name": "Dr. Joaquin \"Jay\" Gonzalez", "Faculty 3 Designation": "Professor", "Faculty 3 Description": "<p>Public and Urban Affairs Professor, Practitioner, and Book Author.</p>", "Faculty 4 Name": "Dr. Anita Manohar", "Faculty 4 Designation": "Associate Professor", "Faculty 4 Description": "<p>Associate Professor &amp; Department Chair for Finance and Economics at Golden Gate University.</p>", "Faculty 5 Name": "Prof. Marcia Ruben", "Faculty 5 Designation": "DBA 880 - Leadership Theory. Research and Application", "Faculty 5 Description": "<p>Expertise in executive leadership, change management, and organizational development. For 25+ years, she has helped individuals, teams, and companies excel by focusing on the human and organizational system issues that impact growth.</p>", "Faculty 6 Name": "Prof. Anthony De Leon", "Faculty 6 Designation": "DBA 870 - Marketing Management", "Faculty 6 Description": "<p>Expertise in business strategy, new product development and go-to-market strategies for payments / processing services. Accomplished writer published in the E-Business Review, and the Economist Intelligence Unit&#39;s Strategic Finance magazine.</p>", "Faculty 7 Name": "Prof. Geoffrey Ngene", "Faculty 7 Designation": "DBA 820 - Corporate Finance", "Faculty 7 Description": "<p>Dr. Ngene is a Financial Economist with consulting, research and teaching experiences in finance and data mining. He teaches Corporate Finance in the GGU DBA program.</p>", "Faculty 8 Name": "Prof. Saida Zeidan", "Faculty 8 Designation": "DBA 871 - Consumer Behaviour", "Faculty 8 Description": "<p>Dr. Zeidan is the head of digital marketing at 3MetaD. She teaches consumer behavior in the GGU DBA program.</p>", "Faculty 9 Name": "Prof. Tommy Moreno", "Faculty 9 Designation": "DBA 882", "Faculty 9 Description": "<p>Dr. Tommy Moreno has 20+ years of experience in training, client education and organizational development in major corporations. He is a contributor to a recently published book Collaboration and Peak Performance - A Multidisciplinary Perspective for Emerging Leaders, and has contributed an ethical case study.</p>", "Faculty 10 Name": "Prof. Marion Moreno", "Faculty 10 Designation": "DBA 881", "Faculty 10 Description": "<p>Marion is a Senior Talent Management Professional with depth of experience in global executive leadership and organization development in Fortune 500 companies including financial services, retail, insurance and energy. Marion is also an Adjunct Professor at the University of San Francisco in the School of Education and California College of the Arts in their Design MBA program.</p>", "fee in inr": "INR                                                1226438                                                                                                 + GST", "fee in usd": "USD                                                15000"},
{"course link": "https://talentedge.com/opjindal-global-business-school/masters-of-business-administration-opj-global-university", "title": "Masters Of Business Administration", "description": "This program is a one year online MBA designed for working professionals. The curriculum is comprehensive and covers aspects of Marketing, operations, finance and HR. Along with the foundational course, the learner may select any of the specializations available for an in-depth understanding of a particular topic: Finance, Digital Finance, Marketing and Strategy & Leadership", "duration": "Duration: 12 months", "Timing": "", "start_date": "31 Mar, 2024", "What you will learn": ["Live & Interactive Digital Learning", "Economics: Micro & Macro", "Operations Management", "Convenient Schedules to Suit Working Professionals", "Dedicated Student Support", "Marketing Fundamentals", "Benefit from Talentedge’s Alumni Network", "Emerging Technology: AI/Blockchain in the context of business", "Human Resource Management", "Practical/Hands-On Experiential Learning", "78% Referability", "92% Satisfaction score", "95% Completion Rate", "Specialization: Advanced content of the chosen field"], "skills": ["Decision Making in business context", "Analytical Thinking", "Problem solving", "Holistic Approach to business"], "target students": "This programme is useful for freshers as well as experienced professionals since it covers all aspects of business starting from fundamentals to complex topics as part of specialisations.", "Prerequisites / Eligibility criteria": "Candidates must hold a graduation degree in any discipline with a minimum of 50% aggregate score from a recognized University.     Candidates will need to take the 30-minute JMAT Online National Level entrance exam. The link to the test is sent after candidates submit their application.     Students who have scored qualifying marks in entrance exams given below any time in the last 3 years are exempted from appearing for JMAT     CAT/XAT/MAT/ATMA ≥ 50 Percentile | GRE ≥ 295 | GMAT ≥ 450 | CMAT/NMAT ≥ 160", "Content": ["The Firm and the Consumer", "Global Economics", "Business Statistics", "Organizational Behaviour", "Analysis of Financial Statement", "Operations Management", "People Management", "Emerging Technology: Impact on Future of Business", "Marketing Management", "Financial Management and Valuation", "Capital Markets and Instrument", "Business Ethics & Corporate Social Responsibility", "Term-wise Independent Research Projects", "Specialisation Courses in Term 4"], "university": " OPJindal Global Business School ", "Faculty 1 Name": "Chris Oates", "Faculty 1 Designation": "Adjunct faculty, upGrad", "Faculty 1 Description": "<p>Chris has a PhD in International Relations from the University of Oxford and a BA from Brown University and lectures at a university in the United States. He founded Two Lanterns Advisory, a political risk consultancy.</p>", "Faculty 2 Name": "Rakesh Godhwani", "Faculty 2 Designation": "Adjunct Professor IIM Bangalore", "Faculty 2 Description": "<p>Rakesh is the founder of an edtech startup; School of Meaningful Experiences, offering Communication for Leaders &amp;amp; Business Communication at IIM.</p>", "Faculty 3 Name": "Prof. Anirban Ganguly", "Faculty 3 Designation": "Vice Dean (Research)", "Faculty 3 Description": "<p>Prof. Anirban holds an MS and PhD from Stevens Institute of Technology, USA. Prior to joining JGBS, he has held faculty positions at City University of New York and Stevens Institute of Technology.</p>", "Faculty 4 Name": "Prof Vineet Anurag", "Faculty 4 Designation": "Professor of Management Practice", "Faculty 4 Description": "<p>Prof.Vineet has over 25 years of experience across institutional and investment banking. He worked in Bank of America for 16 years, ending his stint as the MD and Country Portfolio Manager for India, Thailand, Indonesia and Philippines. He joined Westpac Banking Corp as Chief Risk Officer for India before moving to Singapore as CRO and Chief Credit Officer for Westpac.</p>", "Faculty 5 Name": "Prof. Asim Talukdar", "Faculty 5 Designation": "Professor (OB-HR), JGBS & Director", "Faculty 5 Description": "<p>Prof. Asim is skilled in the HR domain of Consulting, Policies, Training, &amp; Leadership and is a Fellow in Management focused on HRM from XLRI Jamshedpur. He has 33+ years of industry experience in top leadership teams of HT Media, NIIT Ltd. and Maruti Suzuki Ltd. as Head of Human Resource Management.</p>", "Faculty 6 Name": "Prof. Anand Sharma", "Faculty 6 Designation": "Associate Professor", "Faculty 6 Description": "<p>Prof. Anand is a Fellow of IIM, Ahmedabad. Dr. Sharma previously worked with IIM Rohtak and IIM Sirmaur. He has also worked as an economic expert in the Antitrust Division of Competition Commission of India.</p>", "Faculty 7 Name": "Prof. Chitrakalpa Sen", "Faculty 7 Designation": "Professor & Associate Dean", "Faculty 7 Description": "<p>Dr. Chitrakalpa holds an M.Sc. in Economics and a PhD. His area of research includes high frequency financial market dynamics, green investments and growth economics. He is also an active member of the school&rsquo;s Centre for Research in Emerging Economies (CREE).</p>", "Faculty 8 Name": "Prof. Diptiman Banerji", "Faculty 8 Designation": "Professor, Marketing Area, and Associate Dean", "Faculty 8 Description": "<p>Dr. Diptiman has worked in corporates like Airtel, Hutchison Essar, Aircel, and CMC among others, and did his PhD from IIM Calcutta. His work has been published in reputed journals and his current areas of research include social marketing and consumer behaviour in emerging markets.</p>", "Faculty 9 Name": "Prof. Rameshwar Arora", "Faculty 9 Designation": "Assistant Professor & Assistant Dean", "Faculty 9 Description": "<p>Dr. Rameshwar is a PhD from IIM Indore. His research work has been presented at international conferences such as the Academy of International Business, British Academy of Management etc. He has previously worked in Marketing &amp; Sales analytics with McKinsey Knowledge Center.</p>", "Faculty 10 Name": "Prof. Sonam Chawla", "Faculty 10 Designation": "Assistant Professor & Assistant Dean", "Faculty 10 Description": "<p>Prof. Sonam is a Fellow in Management MDI, Gurgaon in Organisational Behaviour. She has published research papers and book chapters in reputed journals like Frontiers in Psychology and has presented her work at Oxford University.</p>", "Faculty 11 Name": "Prof. Sarveshwar Kumar Inani", "Faculty 11 Designation": "Assistant Professor", "Faculty 11 Description": "<p>Prof. Sarveshwar is a Ph.D. in finance and accounting from IIM Lucknow. He holds double master&rsquo;s, i.e, MBA Finance and M.Com. Accountancy and Business Statistics. His research interests are focused primarily on price discovery and volatility spillover in financial markets.</p>", "Faculty 12 Name": "Prof. Gunjan Mohan Sharma", "Faculty 12 Designation": "Professor & Associate Dean", "Faculty 12 Description": "<p>Prof. Gunjan has 10+ years of experience in academics, and is an MBA and PhD from Aligarh Muslim University. His interests include HR Analytics, Talent Management and Sentiment Analysis.</p>", "Faculty 13 Name": "Amit Tyagi", "Faculty 13 Designation": "CEO, Payworld", "Faculty 13 Description": "<p>Amit is a seasoned professional with experience in payments, remittances, lending, banking, consumer cards and portfolio management and has worked with several FinTech firms in leadership roles.</p>", "Faculty 14 Name": "Parth Parikh", "Faculty 14 Designation": "Founder, FinShiksha", "Faculty 14 Description": "<p>Parth is a finance professional with key work in Sector Research, Risk Management, Financial Modelling and Wealth Management. He is a PGDM in finance from NMIMS and works with FinShiksha</p>", "fee in inr": "INR                                                127119                                                                                                 + GST", "fee in usd": "USD                                                0"},
{"course link": "https://talentedge.com/esgci-school-of-management-paris/doctorate-of-business-administration-esgci", "title": "Doctorate Of Business Administration", "description": "Under the guidance of scholar-practitioners, unlock the management's terminal degree by Ecole Supérieure de Gestion et Commerce International, Paris. Cement your industry expertise with a doctorate degree while you work.", "duration": "Duration: 36 Months", "Timing": "2 hours of live lectures per week", "start_date": "31 Mar, 2024", "What you will learn": ["1:1 Thesis Supervision", "International Academic Support", "Recognizing and solving the business problem", "Disruptive Innovation Strategy", "Data collection techniques", "70+ Faculty - Industry Collaborations", "Networking opportunities with 75+ nationalities", "Organizational Agility and Winning Execution"], "skills": ["Applied Research", "Concept Selection", "Management Issues Redressal", "Critical Decision-Making", "Analytical Skills"], "target students": "Working professionals who are looking for a transition into the C-suite, Senior Management professionals looking to become experts in their domain of choice", "Prerequisites / Eligibility criteria": "Master's Degree (or equivalent) or Bachelors Degree with 5+ years of work experience.", "Content": ["Foundation Phase", "Dissertation Phase"], "university": " ESGCI School of Management, Paris ", "Faculty 1 Name": "Dr. Josse Roussel", "Faculty 1 Designation": "Professor", "Faculty 1 Description": "<p>Professor at Paris School of Business and head of DBA development. He got his Ph.D. in finance and management from the Universit&eacute; Paris-Dauphine and certification to supervise doctoral research (H.D.R) from the Universit&eacute; Paris-II Panth&eacute;on Assas. His research focuses on finance and monetary policies, human capital, and the digitization of management. He authored 5 books and published multiple research articles in peer- reviewed journals such as The Journal of Developing Areas, International Journal of Emerging Markets, International Journal of Business and Social Science, Human Resource Planning, The Journal of European etc.</p>", "Faculty 2 Name": "Dr. Alain Kruger", "Faculty 2 Designation": "Professor", "Faculty 2 Description": "<p>After an enriching experience at Kodar, Dr. Kruger graduated with a PhD in Management Sciences, in the field of cultural influences in the consumer&rsquo;s behavior at the University of Bourgogne. A marketing consultant in pharmaceutical and automobile industries where he lead the CODIVA group as well as Renault, Nissan, Citro&euml;n, Volvo, Dacia and Honda brands. The main author of the book Mini Manuel de Marketing at Dunod Editions in 2010 and has written several scientific publications during his time with ESGCI School of Management, Paris.</p>", "Faculty 3 Name": "Dr. Yannick Miel", "Faculty 3 Designation": "Professor", "Faculty 3 Description": "<p>Completed a PhD in aiding and management control. The focus was the identification of the factors of application or non-a pplication of the norms by the employees (quality standard). Member of the operational management committee of Galileo Global Education France, Dr. Miel oversees the management system of activities, development of professional certificates, handicap policy, and the client experience. He is also one of the auditors at COFRAC for Qualiopi accreditation, the official quality norm of the French educational sector.</p>", "Faculty 4 Name": "Prof. Aparajit Parthasarathy", "Faculty 4 Designation": "Professor", "Faculty 4 Description": "<p>Nearing completion of Doctorate in Neuromarketing, Prof. Aparajit Parthasarathy is coming from a vast amount of experience in international marketing, communication, and branding. He is an award winning entrepreneur and has worked in the UK, France, USA and India and successfully launched products, distribution partnerships and client acquisitions over the years before joining ESGCI School of Management, Paris. He has also published articles in Cambridge.</p>", "Faculty 5 Name": "Prof. Sophie Agulhon", "Faculty 5 Designation": "Professor", "Faculty 5 Description": "<p>Prof. Sophie has experience in teaching as well as in research with 3 universities, 3 branches of the French National Conservatory of Arts &amp; Crafts (Cnam), 2 engineering schools and 2 apprenticeship training centers. In her research, she uses qualitative research methodologies viz. different types of observations, interviews, experiments, corpus analyses, and various coding (thematic coding, double coding according to the methodology developed by Gia, etc.). Fields of research relate to organization, the management of industrial and cyber risks, professional training, and the history of management.</p>", "fee in inr": "INR                                                740741                                                                                                 + GST", "fee in usd": "USD                                                9055"},
{"course link": "https://talentedge.com/iim-raipur/post-graduate-executive-certification-in-human-resource-management-iimr-hr", "title": "Executive Certificate ProgramIn Human Resource Management", "description": "Effective management of human capital and maintaining a cordial organization culture is critical to the success of most businesses. Regardless of whether an organization is an SME or a multinational organization; Human Resource Department (HRM) is the central cohesive source of development for any business.", "duration": "", "Timing": "", "start_date": "", "What you will learn": ["78% Referablity", "Live tech support", "HR in Global Virtual Scenario", "One on one interactions", "Convenient Schedules to Suit Working Professionals", "Options for Loan Assistance", "95% Completition Rate", "Behavioural Issues within the Organization", "Talent Management", "Tools & Techniques of People Management", "Benefit from Talentedge’s Alumni Network", "Mobile platform enabled", "92% Satisfaction Score", "Fundamentals of HR", "HR Planning", "Live & Interactive Digital Learning"], "skills": ["Communication", "HR Planning & Management", "Talent Management", "Decision-Making", "IR & Legal Framework", "Reward & Recognition"], "target students": "Early HR professionals, Aspiring HR professionals, HR Managers, Entrepreneurs", "Prerequisites / Eligibility criteria": "Education          For Indian Participants – Graduates from a recognized university (UGC/AICTE/DEC/AIU/State Government) in any discipline     For International Participants – Graduation or equivalent degree from any recognized University or Institution in their respective country     Proficiency in English, spoken and written, is mandatory         Work Experience          HR Professionals – Minimum of at least 2 years of relevant work experience     Non HR Professionals – Minimum of 4 years of work experience", "Content": ["Fundamentals of HR", "Fundamentals of OB", "Organizational Structure & Design", "HR as a Business Partner (Strategic and Operational)", "Talent Management", "General Management", "Campus Component"], "university": " IIM Raipur ", "Faculty 1 Name": "Prof. Damini Saini", "Faculty 1 Designation": "Assistant Professor", "Faculty 1 Description": "<p><strong>Area</strong>: HRM &amp; Organizational Behaviour</p>\r\n\r\n<p>Prof. Damini Saini is an Assistant Professor in the area of Human Resource Management/ Organizational Behavior at Indian institute of Management, Raipur. Dr. Saini holds a PhD degree in HRM/OB from Faculty of Management Studies (FMS), University of Delhi. Her dissertation discusses the study of human development with Integral leadership model, that talks about the transcends of mind and possibilities of transformation from outside to inside and reflects the psychological, emotional, and spiritual well-being. Apart from this her scholarly interests are leadership, business ethics, significance of ethical education in management, and value-based management etc. She has contributed to various internationally acclaimed journals and book chapters. She has also actively taken part in various conferences and seminars.</p>", "Faculty 2 Name": "Prof. Anubha Dadhich", "Faculty 2 Designation": "Assistant Professor", "Faculty 2 Description": "<p><strong>Area</strong>: HRM &amp; Organizational Behaviour</p>\r\n\r\n<p>Prof. Anubha Dadhich is an Assistant Professor of Human Resource Management at Indian Institute of Management Raipur. Her research investigates the dimensions, outcomes, and antecedents of ethical leadership. Her research interest ranges from underpinning issues of leadership, culture, HR analytics, capacity building and organizational effectiveness.</p>\r\n\r\n<p>She holds a PhD Degree from Department of Management Studies, Indian Institute of Technology Delhi. Dr Dadhich has conducted trainings and management development programs for public &amp; private sector organization.</p>\r\n\r\n<p>She has published articles in journals of national and international repute, Journal of Business Ethics, International Journal of Global Competitiveness &amp; Vikalpa. Prior to IIM Raipur, she has been associated with BITS Pilani, Center for Management Studies, Jamia Milia Islamia University, Delhi. She has developed a course on &ldquo;Leadership and Change Management&rdquo; for working executives and launched on MOOC platform for the first time at IIM Raipur. Alongside with academia Dr Dadhich has worked in different capacity with DFID, PRAYAS &amp; UNICEF.</p>", "fee in inr": "INR                                                150000                                                                                                 + GST", "fee in usd": "USD                                                3000"},
{"course link": "https://talentedge.com/iim-lucknow/advanced-program-in-strategic-management-for-business-excellence", "title": "Advanced ProgramIn Strategic Management For Business Excellence", "description": "In this heavily competitive and equally uncertain business environment, any organization that is committed to succeed has to constantly identify and explore strategic alternatives as well as align resources and ensure implementation. The responsibility to strategically manage and lead a business to success while balancing everyday demands and internal as well as external challenges can prove to be daunting to most leaders who do not have any structured knowledge of what strategic management entails.", "duration": "Duration: 9 months", "Timing": "Sundays from 10.00 a.m. to 1.15 p.m. IST. (3 Hours)", "start_date": "30 Jun, 2024", "What you will learn": ["78% Referablity", "Advanced Contemporary Themes in Strategy", "Live & Interactive Digital Learning", "Implementation and Execution of Strategies", "Convenient Schedules to Suit Working Professionals", "Leadership Styles and Attributes", "Options for Loan Assistance", "95% Completition Rate", "Types of Strategies", "Pertinent and Dynamic aspects of Strategy", "Benefit from Talentedge’s Alumni Network", "Live Tech Support", "92% Satisfaction Score", "One-on-one Interactions", "Mobile Platform Enabled", "Global Business & Economic Environment", "Entrepreneurship & Innovation"], "skills": ["Decision Making", "Strategic Leadership", "Motivational Skills", "Innovation", "Persuasion and Influencing Skills", "Communication", "Critical Thinking Skills", "Leadership Excellence", "Human Resource Management"], "target students": "Industry Leaders, Business Unit Heads, Divisional Heads, Mid-Level Executives", "Prerequisites / Eligibility criteria": "For Indian Participants – Graduates (10+2+3) or Diploma Holders (only 10+2+3) from a recognized university (UGC/AICTE/DEC/AIU/State Government) in any discipline     For International Participants – Graduation or equivalent degree from any recognized University or Institution in their respective country         Work Experience          Working professionals with a minimum of 7 years of work experience      Note: For program aspirants with more than 20 years of work experience, selection will be on a case-to-case basis         Selection Criteria          Completed application form     Satisfaction of the pre-defined qualification and work experience criteria     Substantiating documents", "Content": ["Strategic Analysis", "Financial Management", "Functional Strategy Formulation", "Business & Corporate Strategy Formulation", "Entrepreneurship & Innovation", "Strategy Implementation", "Managing Digital Transformation in Era of Industry 4.0", "Strategic Leadership", "Advanced Contemporary Themes in Strategy and Organization", "Campus Component"], "university": " IIM Lucknow ", "Faculty 1 Name": "Dr. Anadi  Saran Pande", "Faculty 1 Designation": "Professor Strategic Management", "Faculty 1 Description": "<p>Dr. Anadi Pande is a Professor of Strategic Management at IIM Lucknow.&nbsp; He is also the Faculty In Charge and Director of IIM Lucknow&rsquo;s Incubator, which is a Section 25 company. He had three periods of engagement with IIM Lucknow as a full time faculty. These being December 2000 to March 2006; August 2014 to October 2015; and November 2016 to present. He is a unique amalgam of academics and industry. He worked with Tata Motors Ltd. for sixteen years and was identified for leadership positions through a fast track scheme of the company. He was Head of Project Engineering at TML&rsquo;s Lucknow plant during its formation and later was Head of Vehicle Assembly factory.&nbsp; He worked for Hero Honda motors for eight years as part of the leadership team being Head of Corporate Planning and Corporate HR. He built alliances for the group; leading separation negotiations to give strategic freedom to Hero Honda (separation of JV). As Project Head, he built the world&rsquo;s largest capacity two wheeler factory at Haridwar. He has deep IR experience.</p>\r\n\r\n<p>In 2014 he moved to Larsen &amp; Toubro, Mumbai, where he was Head &ndash; Corporate Strategy/Initiatives, reporting to Chairman. Later he joined Hero Cycles Ltd as Director, Corporate Strategy and Corporate HR, reporting to CMD. There he joined the Board of Directors of a British Subsidiary, Avocet Sports, Manchester. He writes and uses cases for pedagogy and has published research in both national and international blind peer reviewed journals of repute.</p>", "Faculty 2 Name": "Prof. Priyanshu Gupta", "Faculty 2 Designation": "Prof IIM Lucknow", "Faculty 2 Description": "<p>Currently, Priyanshu is a faculty member in the Business Sustainability area at IIM Lucknow where he teaches Social Entrepreneurship, Impact Investing, Sustainability &amp; Management Reporting, Environmental Governance, and related topics. He holds a PhD in Public Policy and Management from IIM Calcutta, PGDM (MBA) from IIM Bangalore, and B.Tech from IIT(BHU) Varanasi. His Phd work focused on the economic theory of property and institutions, analysis of policy design and implementation processes, and questions of resource governance. Prior to IIM Lucknow, he has around 9 years of corporate and development sector experience spanning impact investing, strategy consulting, and grassroots civil society and policy consulting. Previously, he was Assistant Professor in the School of Development at Azim Premji University. Prior to his shift to academia, Priyanshu was Associate Vice President at Lok Capital, a leading social venture capital fund focused on investing in for-profit social enterprises with focus on financial inclusion, skill development and livelihoods. Prior to Lok, he worked as strategy and operations consultant at A.T. Kearney Limited where he was advising Fortune 500 companies across industries and functions.</p>", "fee in inr": "INR                                                2000                                                                                                 + GST", "fee in usd": "USD                                                    30"},
{"course link": "https://talentedge.com/iim-kozhikode/professional-certificate-programme-in-hr-management-and-analytics", "title": "Professional Certificate ProgrammeIn HR Management And Analytics", "description": "This program deals with the collection and management of talent data and its effective application. The course helps to develop the HR analytical skills to handle the data-driven insights and improve the workforce. The managerial skills acquired during this program helps to take informed decisions and promote employee experience. It is targeted for HR practitioners who intend to learn and utilize organizational data for prescriptive and predictive recommendations which will help them to meet business goals. Learn the fundamentals and strategic role of HR, valuation, benchmarking, KPI dashboards, performance and goal setting, talent sourcing and acquisition, retention, and employee wellness.", "duration": "Duration: 5 Months", "Timing": "Format: Online", "start_date": "15 Feb, 2024", "What you will learn": ["Workforce Planning and Talent sourcing", "95% Completition Rate", "HR Management", "Talent Acquisition and Development Analytics", "92% Satisfaction Score", "HR Practices and Benchmarking"], "skills": ["Talent sourcing", "Employee retention,", "Workforce planning", "Development Analytics", "HR best practices"], "target students": "Managers/ HR Professionals who need to take crucial business decisions through HR Management and Analytics, Non HR Professionals wish to enter HR field, MBA Graduates aspiring to learn importance of HR Management and Analytics", "Prerequisites / Eligibility criteria": "- Minimum 2 years work experience if you have a Bachelor's Degree   - Freshers can apply if you have a Master’s Degree.", "Content": ["Introduction to HR Analytics", "HR Practices and Benchmarking", "Workforce Planning and Talent Sourcing Analytics", "Talent Acquisition and Development Analytics", "Induction and Culture Fit- Value Congruence", "Talent Engagement Analytics", "Collaboration Analytics - Building Effective Systems", "Talent Analytics- Performance, Potential & Rewards", "Talent Retention Analytics", "Employee Wellness- Health & Safety", "Capstone Project"], "university": " IIM Kozhikode ", "Faculty 1 Name": "Prof T.N. Krishnan", "Faculty 1 Designation": "Professor, IIM Kozhikode", "Faculty 1 Description": "<p>Prof. T.N. Kishnan teaches Organizational Behaviour and<br />\r\nHuman Resources. &nbsp;He is a Fulbright<br />\r\nSenior Fellow from Wharton School, University of Pennsylvania and IIM<br />\r\nAhmedabad.&nbsp;</p>\r\n\r\n<p><br />\r\nHis areas of expertise include Talent &amp; Performance<br />\r\nManagement, Corporate/Public Sector Leadership, Corporate Accountability and<br />\r\nHuman Resource Management. He has presented paper at the program of the North<br />\r\nAmerican Case Research Association (NACRA) at San Antanio, Texas on Sustaining<br />\r\na Social Enterprise. He has earlier served as Managing Editor, IIMK Society<br />\r\n&amp; Management Review, from June 2017-March 2019.</p>", "Faculty 2 Name": "Prof. Kapil Verma", "Faculty 2 Designation": "Assistant Professor, IIM Kozhikode", "Faculty 2 Description": "<p>Prof. Kapil Verma had been the Chairperson, OB &amp; HR<br />\r\narea. He holds a Ph.D. degree in Organizational Behavior, Nanyang Technology<br />\r\nUniversity, Singapore. He teaches lessons from Positive Psychology on improving<br />\r\none&#39;s well-being, Leadership and Change Management, organizational theory- design,<br />\r\nstructure, and culture and organizational behaviour.&nbsp;</p>\r\n\r\n<p>His research areas include subjects like positive emotions, employee well-being, responsible leadership, regulatory focus, goal orientation<br />\r\n&amp; organizational justice.</p>", "Faculty 3 Name": "Prof. Prantika Ray", "Faculty 3 Designation": "Assistant Professor, IIM Kozhikode", "Faculty 3 Description": "<p>Prantika is currently serving as Assistant Professor in<br />\r\norganizational behaviour and human resources. She holds a bachelor&rsquo;s degree in<br />\r\nInstrumentation and Electronics Engineering, Jadavpur University and Ph.D. in<br />\r\nHuman Resources Management from IIM, Ahmedabad.&nbsp;</p>\r\n\r\n<p>Her areas of research include cross-cultural Management, Generational HRM, future of work, knowledge sharing, spirituality &amp; well-being.</p>", "fee in inr": "INR                                                105932                                                                                                 + GST", "fee in usd": "USD                                                1287"},
{"course link": "https://talentedge.com/iim-lucknow/supply-chain-management", "title": "Executive ProgramIn Supply Chain Management During Uncertain Times", "description": "The Executive Program in Supply Chain Management During Uncertain Times, from IIM Lucknow, seeks to help working professionals develop capabilities that will enable them to make effective managerial decisions and tackle complex challenges involving supply chain uncertainty amidst the global pandemic. The course focuses on developing the participant’s functional management skills, strategic planning, and complimentary problem-solving skills to enhance their technical expertise. This course also aims to develop the modeling and analytical capabilities of the participants, which are crucial for higher-level managerial responsibilities.", "duration": "Duration: 9 months", "Timing": "Sundays from 10.00 a.m. to 01.15 p.m. IST (3 Hours). Date for Academic orientation: 11th March 2023", "start_date": "05 May, 2024", "What you will learn": ["Issues and challenges in warehouse management, its role in the allocation and accumulation of goods in the supply chain", "78% Referablity", "Convenient Schedules to Suit Working Professionals", "Logistics and purchasing concepts to improve supply chain operations", "Options for Loan Assistance", "Consequences of real decisions that impact the supply chain like cost, quality, customer service, coordination, outsourcing etc.", "95% Completition Rate", "Supply chain management issues in a firm", "Role of inventory and Warehouse management in overall planning and execution of supply chain management", "Dynamic pricing in Supply Chain", "Supply chain in the areas of transportation, purchasing, inventory management and customer service", "Application of latest technologies such as Industry 4.0, Blockchain Technology, IOT, Dynamic Pricing etc in supply chain environment during uncertain times", "Benefit from Talentedge’s Alumni Network", "92% Satisfaction Score", "Mobile platform enabled", "Live & Interactive Digital Learning", "One-on-one interactions"], "skills": ["Supply Chain Management", "Operation Management", "Innovation skills", "Risk Management", "Warehouse Management", "Logistics & Transportation Management"], "target students": "Mid-level Professionals, Senior-level Executives, Young Professionals, Professionals in Operations & Supply Chain", "Prerequisites / Eligibility criteria": "For Indian Participants – Graduates (10+2+3) or Diploma Holders (only 10+2+3) from a recognized university (UGC/AICTE/DEC/AIU/State Government) in any discipline with minimum 50% marks.     For International Participants – Graduation or equivalent degree from any recognized University or Institution in their respective country.     Proficiency in English, spoken and written, is mandatory.         Work Experience          Working professionals with a minimum of 2 years of work experience.     Note: For program aspirants with more than 20 years of work experience, selection will be on a case-to-case basis.         Selection Criteria          Completed application form.     Satisfaction of the pre-defined qualification and work experience criteria.     Substantiating Documents.", "Content": ["Fundamentals of Operations Management", "Demand Forecasting & Capacity Management", "Supply Chain Planning", "Introduction to Supply Chain Management & Supply Chain Strategy", "Inventory Management", "Sourcing, Supplier Relationships and Supply Chain Coordination", "Logistics and Transportation Management", "Dynamic Pricing in a Supply Chain", "Retail, E-Commerce & Distribution Operations", "Technological Innovations within Supply Chain Management", "Capstone Project", "Campus Component"], "university": " IIM Lucknow ", "Faculty 1 Name": "Dr. Yash Daultani", "Faculty 1 Designation": "Program Director", "Faculty 1 Description": "<p>Dr. Yash Daultani is a Faculty member of the Operations Management Group at the IIM Lucknow. Prior to joining the institute, he was with IIITM Gwalior and IMI Kolkata for a brief period. He holds a Doctoral (Fellow) degree from the Indian Institute of Management Lucknow. He consults and publishes in the areas of supply chain network design, product design, supply chain risk management, and healthcare operations management. He is currently working on Industry 4.0 applications in the domain of operations and supply chain management.</p>", "Faculty 2 Name": "Dr. Suresh K Jakhar", "Faculty 2 Designation": "Program Director - IIM Lucknow", "Faculty 2 Description": "<p>Dr. Suresh K Jakhar is currently working as an Associate Professor at Operations Management Group at IIM Lucknow. Currently, he is also holding the responsibility of Chairman, OM Area. At IIM Lucknow he is teaching courses like Revenue Management and Dynamic Pricing (Term IV) Game Theory and Mechanism Design (Term V) and Supply Chain Management (Term III). He has guided 4 doctoral students at IIM Lucknow. He has also conducted more than 50 training programs for various MNCs, PSUs, and bureaucrats. he has completed his M.Tech from IIT Delhi and Ph.D. from IIT Roorkee. He has published more than 20 research papers in various international journals.</p>", "fee in inr": "INR                                                1500                                                                                                 + GST", "fee in usd": "USD                                                    0"},
{"course link": "https://talentedge.com/goa-institute-of-management/exectuive-pg-program-in-health-care-management", "title": "Executive Post Graduate ProgramIn Health Care Management", "description": "India's healthcare industry is expected to grow and hit $50 billion in size by 2025. Healthcare has become more focused on innovation and technology in the post-Covid era. About 80% of the healthcare ecosystem aims to increase investment in digital healthcare tools in the foreseeable future. Telemedicine is also expected to reach $5.5 billion by 2025. Since there is a huge scope in the Healthcare domain in the coming future it is wise to build a career in this field. For this reason GIM has introduced a comprehensive course on the Healthcare Management. ", "duration": "Duration: 11 months", "Timing": "8-10 hours/week", "start_date": "31 Mar, 2024", "What you will learn": ["78% Referablity", "Healthcare Marketing", "Medico-Legal and Ethical Aspects of healthcare organisations", "Options for Loan Assistance", "92% Satisfaction Score", "Hospital Planning & Services", "95% Completion Rate", "Qualitative Research Methodologies"], "skills": ["Hospital Planning and Services", "Ethical & Legal issues in Healthcare", "Healthcare Marketing", "Operations and Material management", "Benchmarking in Healthcare"], "target students": "Freshers, Early-age Professionals, Medical Professionals, Entrepreneurs", "Prerequisites / Eligibility criteria": "Professionals/freshers holding any bachelor’s degree from a recognized institute/university.     Diploma holders (10+2+3) can also apply for this course", "Content": ["Program Introduction", "Fundamentals of Management and Organisational Behaviour", "Hospital Planning and Services", "Business Communication", "Benchmarking in Healthcare", "Financial Management", "e-Skills in Healthcare", "Human Resource Management in Healthcare", "Problem Solving Skills", "Ethical and Legal Aspects of Healthcare", "Material Management in Healthcare", "Interview Skills", "Healthcare Marketing", "Research Methodologies in Healthcare", "Capstone Project"], "university": " Goa Institute of Management ", "Faculty 1 Name": "Ajay Vamadevan", "Faculty 1 Designation": "Professor, Healthcare Management", "Faculty 1 Description": "<p>Ajay is a Professor at the Goa Institute of Management. He holds a doctoral degree from the University of London for his work on developing a mHealth-enabled intervention for hypertension and diabetes care in Himachal Pradesh, India.</p>\r\n\r\n<p>Ajay has, overall, 18 years of experience in non-communicable disease (NCD) epidemiology and prevention. In the past ten years, he was into the application of digital health for improving the care delivery of common chronic NCD conditions in primary care. His work led to the development of the &quot;mPower Heart Digital Health System&quot; for NCD care. The electronic clinical decision support (EDSS) module of the mPower Heart Digital Health System has been integrated into the national Electronic Health Record portal of the Government of India.</p>", "Faculty 2 Name": "Alekh Gour", "Faculty 2 Designation": "Associate Professor, Healthcare Management", "Faculty 2 Description": "<p>Dr. Alekh Gour is currently working as Associate Professor at the GIM. He is a Researcher and Academician. He has done his graduation in Computer Science and Engineering and post-graduation in Bioinformatics. He has diverse teaching experience in the areas of Computer Science and Bioinformatics. He has been awarded a Ph.D. in the field of Bioinformatics by NIT Bhopal. His major research area is &quot;Data Analytics Techniques in Bioinformatics&quot;. He has published research papers in reputed national and international journals. He has conducted several workshops and MDPs in different areas of Data Science. He has also been awarded the Young Scientist Award by the M.P Council of Science and Technology, Govt. of Madhya Pradesh. Recently he has been awarded as &ldquo;InsideIIM Professor of the Year 2020 at GIM&rdquo;.</p>", "Faculty 3 Name": "Arif raza", "Faculty 3 Designation": "Associate Professor, Healthcare Management", "Faculty 3 Description": "<p>Arif takes a keen interest in the nuances of healthcare delivery with a specific focus on the quality of care and patient safety. He worked with a few hospitals in a managerial capacity and offered management consulting services to several others. He has also developed a deep realization of the crucial role that &lsquo;quality of care&rsquo; plays in healthcare delivery. He holds an experience of more than one and a half decades and has enriched a deeper sense of understanding of how the world functions, which has shaped his perspective of how a healthcare organization must operate to effectively achieve its objectives.</p>", "Faculty 4 Name": "Devasheesh mathur", "Faculty 4 Designation": "Assistant Professor, Healthcare Management", "Faculty 4 Description": "<p>Devasheesh Mathur is an Assistant Professor in Healthcare Management with valuable experience at Think Tanks and Start-ups. He is an alumnus of the Indian Institute of Technology Bombay where he studied Metallurgical Engineering and Materials Science. He later conducted research on medical implants and biomaterials. Through his research, he reduced the failure rates of dental implants. He then became interested in policy sciences and started his doctoral research at the School of Public Policy and Governance at MDI Gurgaon after working at a policy think tank. His doctoral research is titled &lsquo;Development of Substantive Theory of Radical Innovations in Public Policies: The Process and Role of Actors in Radical Health Policy Innovations&#39;. He was fortunate to have the &lsquo;Father of Public Service Innovation&rsquo;, Prof. Sandford Borins, on his Thesis Committee. Through his research, he has come up with a theoretical model and a strategic framework to facilitate more sustainable innovations and transformative changes in the Indian public health systems.&nbsp;</p>", "Faculty 5 Name": "Kheya furtado", "Faculty 5 Designation": "Associate Professor, Healthcare Management", "Faculty 5 Description": "<p>Kheya is an Associate Professor of Healthcare Management at the Goa Institute of Management.&nbsp;Her areas of research, consultancy, and teaching are Health Systems Financing, Public Health, and Epidemiology.&nbsp;Her current research focuses on the implementation assessment of PMJAY and other publicly financed health protection schemes in India, implemented at the national and state level. &nbsp;She has secured research projects as a Principal Investigator from the World Health Organization (WHO) and Harvard School of Public Health.&nbsp;</p>\r\n\r\n<p>Prior to GIM, she served at the Health Division of the NITI Aayog, Government of India, where she implemented key projects such as the NITI Health Index for ranking States &amp; UTs on their performance in Health, the drafting of the Health Chapter of the Three- Year Action Agenda for Government of India 2017-18 to 2019-20 and the NITI District hospital index for monitoring the performance of public hospitals. She also contributed policy inputs on the various national health schemes and initiatives. Her doctoral research was carried out in disease surveillance and private sector participation, under the INSPIRE fellowship award of the Department of Science and Technology.&nbsp;</p>", "Faculty 6 Name": "Shawnn coutinho", "Faculty 6 Designation": "Assistant Professor, Healthcare Management", "Faculty 6 Description": "<p>Shawn had 11+ years of experience in the industry prior to joining academics. He worked with leading multinationals in various capacities, in diverse sectors from Healthcare (Johnson &amp; Johnson), Information Technology (Wipro), and Energy (Reliance). Joined the Goa Institute of Management in the year 2016 as a faculty in healthcare. Areas of interest are healthcare marketing, branding, pricing strategy, new product development, and sales &amp; distribution. Currently also consults with leading healthcare organizations in developing India market access strategy and marketing. Has conducted MDP programs for the Government of Goa, Johnson &amp; Johnson, and other pharma companies.</p>", "Faculty 7 Name": "Sreerupa sengupta", "Faculty 7 Designation": "Assistant Professor, Healthcare Management", "Faculty 7 Description": "<p>Dr. Sreerupa Sengupta has a Ph.D. in Women&rsquo;s Studies from Jadavpur University. She received a fellowship from the Tokyo Foundation for Policy Research, Japan for her doctoral research on AIDS Communication, gender, and human rights. She was a Visiting Fellow at Howard University, Washington D.C., USA, and the American University of Cairo, Egypt. She has attended an Advanced Professional Training Program on Global Governance and Sustainable Development organized by German Development Institute, Bonn, Germany.&nbsp; Sreerupa&rsquo;s career has spanned over 12 years in diverse sectors &ndash; academia, NGO, and industry. She has developed audio-visual educational materials for NGOs on HIV, Violence against Women, and human rights. &nbsp;She has taught courses on &ndash; Health and Human Rights, Sustainable Development and Social Action, Gender and Governance, Gender Development, and Qualitative Research.</p>", "Faculty 8 Name": "Supriya phadnis", "Faculty 8 Designation": "Assistant Professor, Healthcare Management", "Faculty 8 Description": "<p>Dr. Supriya Phadnis is a public health expert with more than 9 years of experience working with governmental, non-governmental, and academic organizations. Supriya completed her Master of Public Health degree from the School of Health Sciences, Savitribai Phule Pune University (formerly known as the University of Pune) in 2008. She received a doctoral degree (Ph.D. in Public Health Sciences) from the School of Health Sciences, Pune University in 2015.&nbsp;Prior to joining the Goa Institute of Management as an Assistant Professor, Supriya worked with non-governmental organizations like the Institute of Health Management, Pachod, government organization, the State Health Systems Resource Centre, NRHM Maharashtra, academic institution, the Department of Health Sciences, University of Pune, several international organizations such as INCLEN Trust International for Bill and Melinda Gates Foundation and Save the Children.&nbsp;</p>", "Faculty 9 Name": "Vilasini Devi Nair", "Faculty 9 Designation": "Assistant Professor, Healthcare Management", "Faculty 9 Description": "<p>Vilasini Devi Nair, joined as Asst. Professor in Health Economics at Goa institute of management in 2019. She was working as Asst. Professor in Health Economics Policy and Management Department of Jimma University, Ethiopia under the UNDP capacity development scheme from 2004-2019. She worked as a lecturer at the School of Medical Education, MG University, Kerala, from 2002-2004. Dr. Devi was selected with a full scholarship for the Health Economics program of PHFI, New Delhi and she received the Young researcher&rsquo;s Grand award in Health Policy and System Research by AHPSR, WHO in 2008. She was selected for 18 months fellowship program in Health Care Financing of Noncommunicable Diseases funded by NIH-US through Monash University Australia in 2012. Dr. Devi attended training programs in Economic Evaluation Techniques, Health System Research methods, Econometric Evaluation in Health, etc. at Oslo University, Sweden.</p>", "fee in inr": "INR                                                97458                                                                                                 + GST", "fee in usd": "USD                                                1189"},
{"course link": "https://talentedge.com/iim-kozhikode/professional-certificate-program-in-strategic-management", "title": "Professional Certificate ProgramIn Strategic Management", "description": "An organization involves a huge principal investment which makes strategizing an essential aspect for running successful internal operations and to get viable returns on the invested money. Realizing the fact that strategic planning is quintessential in successfully assisting a business through any sudden contingencies, organizations are promisingly adapting the strategic management process. An organization’s ability to achieve growth and success majorly depends on the ability of its senior management and leaders to formulate effective strategies and productively execute them. Their involvement in one or the other phase of the Strategic Management process makes it imperative for them to develop strategical skills and lead the organization onto the success path. So if you’re an important milestone in the organization’s decision making process then this course will aid you to contribute to business success and share it through your own professional progress. The objective of strategic management course from IIM is to help the participants develop their competence in the Strategic Management process which consists of Strategic Thinking, Strategic Planning, Strategy Execution and Strategy Applications.", "duration": "", "Timing": "", "start_date": "", "What you will learn": ["Convenient Schedules to Suit Working Professionals", "Options for Loan Assistance", "Dedicated Student Support", "95% Completion Rate", "Entrepreneurship and new ventures", "Strategic planning", "Benefit from Talentedge’s Alumni Network", "Organizational Structure & System", "Practical/Hands-On Experiential Learning", "78% Referability", "92% Satisfaction score", "Strategic management", "Live & Interactive Digital Learning"], "skills": ["Strategic management", "Strategic planning", "Strategic thinking", "Decision-making"], "target students": "Industry leaders, Divisional Heads, Middle-level Executives, Working Professionals", "Prerequisites / Eligibility criteria": "• For Indian Participants – Graduates (10+2+3) or Diploma Holders (only 10+2+3) from a recognized University (UGC/AICTE/DEC/AIU/State Government) in any discipline      • For International Participants – Graduation or equivalent degree from any recognized University or Institution in their respective country      • Proficiency in English, spoken & written is mandatory      • Minimum 7 years of work experience in a business enterprise or at least 5 years of experience in a managerial position.", "Content": ["Strategic Thinking", "Strategic Planning", "Strategy Execution", "Strategy Application", "Strategic Challenges"], "university": " IIM Kozhikode ", "Faculty 1 Name": "Dr. S. Subramanian", "Faculty 1 Designation": "Assistant Professor, Ph.D, MBA, B.E (Mech)", "Faculty 1 Description": "<p>Dr. S. Subramanian is an Associate Professor in the area of Strategic Management at IIM Kozhikode. He has 18 years of experience in management education and taught in the top ranked B-schools in India and abroad. He also has strong industry connection through executive education programs and consulting assignments in the field of Strategic Management.</p>\r\n\r\n<p>Awards<br />\r\nA case study titled &lsquo;Scope e-Knowledge Center&rsquo; won the Best Case award in the Case Chase competition conducted at &lsquo;Indian School of Business&rsquo; (ISB), Hyderabad in April 2005.</p>\r\n\r\n<p>Significant Publications<br />\r\nSubramanian.S &amp; Reddy.V.N (2012) &lsquo;Corporate Governance Disclosures and International Competitiveness: A study of Indian Firms&rsquo;, Asian Business &amp; Management, Vol. 11 No. 2, pp-195&ndash;218</p>\r\n\r\n<p>Subramanian.S &amp; Reddy.V.N (2010) &lsquo;Relationship between Voluntary Disclosures and International Competition&rsquo;, The Decision &ndash; IIM Calcutta Vol.37, No.2, pp 31-50</p>\r\n\r\n<p>Subramanian.S (2008) &lsquo;The Knowledge Company&rsquo; a chapter in a book titled &lsquo;Entrepreneurship development- Cases on Indian Change Agents&rsquo; edited by.K.Ramachandran, Professor, Indian School of Business (ISB) Hyderabad and Published by Tata Mc Graw Hill</p>\r\n\r\n<p>Vedpuriswar.A.V., Subramanian.S and Kaul Vivek (2004) &lsquo;Coming up short on Disclosures&rsquo; Indian Management, Vol.43, No.8, pp 60-66</p>", "fee in inr": "INR                                                80000                                                                                                 + GST", "fee in usd": "USD                                                1750"},
{"course link": "https://talentedge.com/iim-kozhikode/applied-financial-risk-management-course", "title": "Professional Certificate ProgramIn Applied Financial Risk Management", "description": "The increasing complexity and growth in the market value of financial assets and their derivatives highlight the need to manage investments in these securities, prudently and optimally. Professionals in financial institutions and corporates need a solid understanding of management and financial risk measurement. This course is designed to introduce various risk management concepts, tools, and techniques. Using an integrated approach, the course will emphasize on the design and implementation of risk management practices in financial institutions. It also deals with the mathematical ideas and the algorithms behind the construction of models for analyzing and managing risk in financial markets. Basically, this course purports to familiarize students with, and deepen their understanding of modern risk management concepts, theories, practices and trends.", "duration": "", "Timing": "", "start_date": "", "What you will learn": ["Convenient Schedules to Suit Working Professionals", "Options for Loan Assistance", "Equity, Currency, and Commodity Markets", "Dedicated Student Support", "Financial Risk Management", "Benefit from Talentedge’s Alumni Network", "Credit risk modelling and credit scores", "Modern risk management concepts", "Practical/Hands-On Experiential Learning", "78% Referability", "92% Satisfaction score", "95% Completion Rate", "Live & Interactive Digital Learning"], "skills": ["Risk management", "Decision-making", "Financial risk management"], "target students": "Working Professionals, Finance Professionals, Unit Heads and Managers, Business Analyst", "Prerequisites / Eligibility criteria": "For Indian Participants – Graduates (10+2+3) from a recognized university (UGC/AICTE/DEC/AIU/State Government) in any discipline     For International Participants – Graduation or equivalent degree from any recognized University or Institution in their respective country     Proficiency in English, spoken & written is mandatory.         Work Experience          An overall experience of minimum 5 years in financial institutions/finance department of non-financial firms, or at least 3 years in a managerial position in such enterprises", "Content": ["Basics", "Financial Instruments and Their Markets", "Market Risk", "Credit Risk", "Other Topics"], "university": " IIM Kozhikode ", "Faculty 1 Name": "Prof. Sony Thomas", "Faculty 1 Designation": "Ph.D (IIT Madras), MBA", "Faculty 1 Description": "Prof. Sony Thomas is Ph.D. in Finance from Department of Management Studies, IIT Madras. He has conducted various training programs in Finance to private and public sector companies. Prior to joining IIMK, he worked with Deloitte Research and GE Money-MSE Financial Decision Sciences Lab.", "Faculty 2 Name": "Dr. Jijo Lukose P J", "Faculty 2 Designation": "Ph.D (IIT Bombay), MBF, ICWA", "Faculty 2 Description": "Prof. Jijo Lukose P J, a doctorate from School of Management, IIT Bombay has designed and delivered training programs for banks and financial institutions including World Bank, ICICI Bank, Bank of America, CRISIL, Ashok Leyland Finance, Reserve Bank of India etc.", "fee in inr": "INR                                                100000                                                                                                 + GST", "fee in usd": "USD                                                2000"}
]